(λ (add : ((ℕ → ℕ) → ℕ → ℕ) → ((ℕ → ℕ) → ℕ → ℕ) → ((ℕ → ℕ) → ℕ → ℕ)) →
 λ (mul : ((ℕ → ℕ) → ℕ → ℕ) → ((ℕ → ℕ) → ℕ → ℕ) → ((ℕ → ℕ) → ℕ → ℕ)) →
 λ (x : (ℕ → ℕ) → ℕ → ℕ) →
 λ (y : (ℕ → ℕ) → ℕ → ℕ) →
 add (mul x x) y)
(λ (n : (ℕ → ℕ) → ℕ → ℕ) → λ (m : (ℕ → ℕ) → ℕ → ℕ) → λ (f : ℕ → ℕ) → λ (x : ℕ) → n f (m f x))
(λ (n : (ℕ → ℕ) → ℕ → ℕ) → λ (m : (ℕ → ℕ) → ℕ → ℕ) → λ (f : ℕ → ℕ) → λ (x : ℕ) → n (m f) x)
(λ (f : ℕ → ℕ) → λ (x : ℕ) → f (f (f (f (f (f x))))))
(λ (f : ℕ → ℕ) → λ (x : ℕ) → f (f (f (f (f (f x))))))
